Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
in.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-admin]
module.sbeacon.aws_lambda_permission.APIGetEntryTypes: Refreshing state... [id=AllowAPIGetEntryTypesInvoke]
module.sbeacon.aws_api_gateway_integration.entry_types: Refreshing state... [id=agi-vio6m3krml-3ycata-GET]
module.sbeacon.aws_api_gateway_integration.configuration: Refreshing state... [id=agi-vio6m3krml-5z5ch2-GET]
module.sbeacon.aws_lambda_permission.APIGetConfiguration: Refreshing state... [id=AllowAPIGetConfigurationInvoke]
module.sbeacon.aws_lambda_permission.S3updateFiles: Refreshing state... [id=SBeaconBackendAllowS3updateFilesInvoke]
module.sbeacon.aws_api_gateway_integration.filtering_terms: Refreshing state... [id=agi-vio6m3krml-jky85c-GET]
module.sbeacon.aws_lambda_permission.APIGetFilteringTerms: Refreshing state... [id=AllowAPIGetFilteringTermsInvoke]
module.sbeacon.data.aws_iam_policy_document.lambda-splitQuery: Reading...
module.sbeacon.data.aws_iam_policy_document.lambda-splitQuery: Read complete after 0s [id=874457810]
module.sbeacon.aws_sns_topic_subscription.performQuery: Refreshing state... [id=arn:aws:sns:ap-southeast-3:209479276142:performQuery:d3018869-722f-4a7d-88f9-a6efe6699c25]
module.sbeacon.aws_lambda_permission.SNSperformQuery: Refreshing state... [id=SBeaconBackendAllowSNSperformQueryInvoke]
module.sbeacon.aws_lambda_permission.APIGetProjects: Refreshing state... [id=AllowAPIGetProjectsInvoke]
module.sbeacon.aws_api_gateway_integration.projects: Refreshing state... [id=agi-vio6m3krml-fjdiup-GET]
module.sbeacon.aws_lambda_permission.APIGetmap: Refreshing state... [id=AllowAPIGetMapInvoke]
module.sbeacon.aws_api_gateway_integration.map: Refreshing state... [id=agi-vio6m3krml-j8e5lu-GET]
module.sbeacon.aws_lambda_permission.APIGetInfo: Refreshing state... [id=AllowAPIGetInfoInvoke]
module.sbeacon.aws_lambda_permission.APIGetinfo-root: Refreshing state... [id=AllowAPIGetinfoRootInvoke]
module.sbeacon.aws_api_gateway_integration.info: Refreshing state... [id=agi-vio6m3krml-bxg27j-GET]
module.sbeacon.aws_api_gateway_integration.root-get: Refreshing state... [id=agi-vio6m3krml-xmavry1oj3-GET]
module.sbeacon.data.aws_iam_policy_document.data-portal-lambda-access: Reading...
module.sbeacon.data.aws_iam_policy_document.data-portal-lambda-access: Read complete after 0s [id=1869699005]
module.sbeacon.aws_api_gateway_integration.admin_proxy: Refreshing state... [id=agi-vio6m3krml-s2ax8c-ANY]
module.sbeacon.aws_lambda_permission.APIadmin_proxy: Refreshing state... [id=AllowAPIadmin_proxyInvoke]
module.sbeacon.aws_api_gateway_integration_response.entry_types: Refreshing state... [id=agir-vio6m3krml-3ycata-GET-200]
module.sbeacon.aws_api_gateway_integration_response.configuration: Refreshing state... [id=agir-vio6m3krml-5z5ch2-GET-200]
module.sbeacon.aws_s3_bucket_notification.updateFiles: Refreshing state... [id=gasi-dataportal-20241204100803980800000001]
module.sbeacon.aws_api_gateway_integration_response.filtering_terms: Refreshing state... [id=agir-vio6m3krml-jky85c-GET-200]
module.sbeacon.aws_api_gateway_integration_response.projects: Refreshing state... [id=agir-vio6m3krml-fjdiup-GET-200]
module.sbeacon.aws_api_gateway_integration_response.map: Refreshing state... [id=agir-vio6m3krml-j8e5lu-GET-200]
module.sbeacon.aws_api_gateway_integration_response.root-get: Refreshing state... [id=agir-vio6m3krml-xmavry1oj3-GET-200]
module.sbeacon.aws_api_gateway_integration_response.admin_proxy: Refreshing state... [id=agir-vio6m3krml-s2ax8c-ANY-200]
module.sbeacon.module.cors-datasets-filtering_terms.aws_api_gateway_integration_response._: Refreshing state... [id=agir-vio6m3krml-q7cb96-OPTIONS-200]
module.sbeacon.module.lambda-splitQuery.aws_iam_policy.additional_json[0]: Refreshing state... [id=arn:aws:iam::209479276142:policy/sbeacon-backend-splitQuery]
module.sbeacon.module.cors-individuals-id-biosamples.aws_api_gateway_integration_response._: Refreshing state... [id=agir-vio6m3krml-e3zeua-OPTIONS-200]
module.sbeacon.module.lambda-data-portal.aws_iam_policy.additional_jsons[0]: Refreshing state... [id=arn:aws:iam::209479276142:policy/sbeacon-backend-dataPortal-0]
module.sbeacon.module.cors-info-root.aws_api_gateway_integration_response._: Refreshing state... [id=agir-vio6m3krml-xmavry1oj3-OPTIONS-200]
module.sbeacon.module.cors-datasets-id-g_variants.aws_api_gateway_integration_response._: Refreshing state... [id=agir-vio6m3krml-3dfpxp-OPTIONS-200]
module.sbeacon.module.lambda-splitQuery.aws_iam_role_policy_attachment.additional_json[0]: Refreshing state... [id=sbeacon-backend-splitQuery-2024120410144227090000002a]
module.sbeacon.module.lambda-data-portal.aws_iam_role_policy_attachment.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-dataPortal-20241204101421043100000029]
module.sbeacon.module.lambda-splitQuery.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-splitQuery]
module.sbeacon.module.lambda-data-portal.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-dataPortal]
module.sbeacon.aws_api_gateway_integration_response.info: Refreshing state... [id=agir-vio6m3krml-bxg27j-GET-200]
module.sbeacon.aws_api_gateway_integration.dportal_proxy: Refreshing state... [id=agi-vio6m3krml-t9zds3-ANY]
module.sbeacon.aws_lambda_permission.APIdportal_proxy: Refreshing state... [id=AllowAPIdportal_proxyInvoke]
module.sbeacon.data.aws_iam_policy_document.lambda-getGenomicVariants: Reading...
module.sbeacon.data.aws_iam_policy_document.lambda-getGenomicVariants: Read complete after 0s [id=23619316]
module.sbeacon.data.aws_iam_policy_document.lambda-getBiosamples: Reading...
module.sbeacon.aws_lambda_permission.SNSsplitQuery: Refreshing state... [id=SBeaconBackendAllowSNSsplitQueryInvoke]
module.sbeacon.data.aws_iam_policy_document.lambda-getAnalyses: Reading...
module.sbeacon.data.aws_iam_policy_document.lambda-getBiosamples: Read complete after 0s [id=128471442]
module.sbeacon.aws_sns_topic_subscription.splitQuery: Refreshing state... [id=arn:aws:sns:ap-southeast-3:209479276142:splitQuery:361e3ae8-35e9-4cc3-8387-7bc3279ef56d]
module.sbeacon.data.aws_iam_policy_document.lambda-getAnalyses: Read complete after 0s [id=128471442]
module.sbeacon.data.aws_iam_policy_document.lambda-getDatasets: Reading...
module.sbeacon.data.aws_iam_policy_document.lambda-getDatasets: Read complete after 0s [id=128471442]
module.sbeacon.data.aws_iam_policy_document.lambda-getIndividuals: Reading...
module.sbeacon.data.aws_iam_policy_document.lambda-getIndividuals: Read complete after 0s [id=128471442]
module.sbeacon.aws_api_gateway_integration_response.dportal_proxy: Refreshing state... [id=agir-vio6m3krml-t9zds3-ANY-200]
module.sbeacon.data.aws_iam_policy_document.lambda-getRuns: Reading...
module.sbeacon.module.lambda-getGenomicVariants.aws_iam_policy.additional_jsons[2]: Refreshing state... [id=arn:aws:iam::209479276142:policy/sbeacon-backend-getGenomicVariants-2]
module.sbeacon.data.aws_iam_policy_document.lambda-getRuns: Read complete after 0s [id=128471442]
module.sbeacon.module.lambda-getGenomicVariants.aws_iam_policy.additional_jsons[0]: Refreshing state... [id=arn:aws:iam::209479276142:policy/sbeacon-backend-getGenomicVariants-0]
module.sbeacon.module.lambda-getGenomicVariants.aws_iam_policy.additional_jsons[1]: Refreshing state... [id=arn:aws:iam::209479276142:policy/sbeacon-backend-getGenomicVariants-1]
module.sbeacon.module.lambda-getBiosamples.aws_iam_policy.additional_jsons[0]: Refreshing state... [id=arn:aws:iam::209479276142:policy/sbeacon-backend-getBiosamples-0]
module.sbeacon.module.lambda-getBiosamples.aws_iam_policy.additional_jsons[1]: Refreshing state... [id=arn:aws:iam::209479276142:policy/sbeacon-backend-getBiosamples-1]
module.sbeacon.module.lambda-getBiosamples.aws_iam_policy.additional_jsons[2]: Refreshing state... [id=arn:aws:iam::209479276142:policy/sbeacon-backend-getBiosamples-2]
module.sbeacon.module.lambda-getDatasets.aws_iam_policy.additional_jsons[0]: Refreshing state... [id=arn:aws:iam::209479276142:policy/sbeacon-backend-getDatasets-0]
module.sbeacon.module.lambda-getAnalyses.aws_iam_policy.additional_jsons[0]: Refreshing state... [id=arn:aws:iam::209479276142:policy/sbeacon-backend-getAnalyses-0]
module.sbeacon.module.lambda-getAnalyses.aws_iam_policy.additional_jsons[1]: Refreshing state... [id=arn:aws:iam::209479276142:policy/sbeacon-backend-getAnalyses-1]
module.sbeacon.module.lambda-getAnalyses.aws_iam_policy.additional_jsons[2]: Refreshing state... [id=arn:aws:iam::209479276142:policy/sbeacon-backend-getAnalyses-2]
module.sbeacon.module.lambda-getDatasets.aws_iam_policy.additional_jsons[1]: Refreshing state... [id=arn:aws:iam::209479276142:policy/sbeacon-backend-getDatasets-1]
module.sbeacon.module.lambda-getDatasets.aws_iam_policy.additional_jsons[2]: Refreshing state... [id=arn:aws:iam::209479276142:policy/sbeacon-backend-getDatasets-2]
module.sbeacon.module.lambda-getIndividuals.aws_iam_policy.additional_jsons[0]: Refreshing state... [id=arn:aws:iam::209479276142:policy/sbeacon-backend-getIndividuals-0]
module.sbeacon.module.lambda-getIndividuals.aws_iam_policy.additional_jsons[1]: Refreshing state... [id=arn:aws:iam::209479276142:policy/sbeacon-backend-getIndividuals-1]
module.sbeacon.module.lambda-getIndividuals.aws_iam_policy.additional_jsons[2]: Refreshing state... [id=arn:aws:iam::209479276142:policy/sbeacon-backend-getIndividuals-2]
module.sbeacon.module.lambda-getGenomicVariants.aws_iam_role_policy_attachment.additional_jsons[1]: Refreshing state... [id=sbeacon-backend-getGenomicVariants-2024120410150735120000002c]
module.sbeacon.module.lambda-getGenomicVariants.aws_iam_role_policy_attachment.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-getGenomicVariants-2024120410150727110000002b]
module.sbeacon.module.lambda-getGenomicVariants.aws_iam_role_policy_attachment.additional_jsons[2]: Refreshing state... [id=sbeacon-backend-getGenomicVariants-2024120410150786930000002d]
module.sbeacon.module.lambda-getBiosamples.aws_iam_role_policy_attachment.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-getBiosamples-20241204101508253600000034]
module.sbeacon.module.lambda-getBiosamples.aws_iam_role_policy_attachment.additional_jsons[2]: Refreshing state... [id=sbeacon-backend-getBiosamples-20241204101508233700000032]
module.sbeacon.module.lambda-getBiosamples.aws_iam_role_policy_attachment.additional_jsons[1]: Refreshing state... [id=sbeacon-backend-getBiosamples-20241204101508275600000035]
module.sbeacon.module.lambda-getRuns.aws_iam_policy.additional_jsons[1]: Refreshing state... [id=arn:aws:iam::209479276142:policy/sbeacon-backend-getRuns-1]
module.sbeacon.module.lambda-getRuns.aws_iam_policy.additional_jsons[0]: Refreshing state... [id=arn:aws:iam::209479276142:policy/sbeacon-backend-getRuns-0]
module.sbeacon.module.lambda-getRuns.aws_iam_policy.additional_jsons[2]: Refreshing state... [id=arn:aws:iam::209479276142:policy/sbeacon-backend-getRuns-2]
module.sbeacon.module.lambda-getAnalyses.aws_iam_role_policy_attachment.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-getAnalyses-20241204101508480200000037]
module.sbeacon.module.lambda-getAnalyses.aws_iam_role_policy_attachment.additional_jsons[1]: Refreshing state... [id=sbeacon-backend-getAnalyses-20241204101508586300000039]
module.sbeacon.module.lambda-getAnalyses.aws_iam_role_policy_attachment.additional_jsons[2]: Refreshing state... [id=sbeacon-backend-getAnalyses-2024120410150866900000003a]
module.sbeacon.module.lambda-getDatasets.aws_iam_role_policy_attachment.additional_jsons[2]: Refreshing state... [id=sbeacon-backend-getDatasets-2024120410150797920000002f]
module.sbeacon.module.lambda-getDatasets.aws_iam_role_policy_attachment.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-getDatasets-2024120410150790600000002e]
module.sbeacon.module.lambda-getDatasets.aws_iam_role_policy_attachment.additional_jsons[1]: Refreshing state... [id=sbeacon-backend-getDatasets-20241204101507999300000030]
module.sbeacon.module.lambda-getGenomicVariants.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getGenomicVariants]
module.sbeacon.module.lambda-getIndividuals.aws_iam_role_policy_attachment.additional_jsons[2]: Refreshing state... [id=sbeacon-backend-getIndividuals-20241204101508320700000036]
module.sbeacon.module.lambda-getIndividuals.aws_iam_role_policy_attachment.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-getIndividuals-20241204101508238600000033]
module.sbeacon.module.lambda-getIndividuals.aws_iam_role_policy_attachment.additional_jsons[1]: Refreshing state... [id=sbeacon-backend-getIndividuals-20241204101508083900000031]
module.sbeacon.module.lambda-getBiosamples.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getBiosamples]
module.sbeacon.module.lambda-getRuns.aws_iam_role_policy_attachment.additional_jsons[2]: Refreshing state... [id=sbeacon-backend-getRuns-2024120410150871250000003b]
module.sbeacon.module.lambda-getRuns.aws_iam_role_policy_attachment.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-getRuns-2024120410150914960000003c]
module.sbeacon.module.lambda-getRuns.aws_iam_role_policy_attachment.additional_jsons[1]: Refreshing state... [id=sbeacon-backend-getRuns-20241204101508527800000038]
module.sbeacon.module.lambda-getAnalyses.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getAnalyses]
module.sbeacon.module.lambda-getDatasets.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getDatasets]
module.sbeacon.aws_api_gateway_integration.g_variants-id: Refreshing state... [id=agi-vio6m3krml-evamqh-GET]
module.sbeacon.aws_api_gateway_integration.g_variants-id-biosamples: Refreshing state... [id=agi-vio6m3krml-kt5usv-GET]
module.sbeacon.aws_api_gateway_integration.g_variants: Refreshing state... [id=agi-vio6m3krml-phabbd-GET]
module.sbeacon.aws_api_gateway_integration.g_variants-id-individuals_post: Refreshing state... [id=agi-vio6m3krml-kdqaiw-POST]
module.sbeacon.aws_api_gateway_integration.g_variants-id_post: Refreshing state... [id=agi-vio6m3krml-evamqh-POST]
module.sbeacon.aws_api_gateway_integration.g_variants-id-individuals: Refreshing state... [id=agi-vio6m3krml-kdqaiw-GET]
module.sbeacon.aws_api_gateway_integration.g_variants_post: Refreshing state... [id=agi-vio6m3krml-phabbd-POST]
module.sbeacon.aws_api_gateway_integration.g_variants-id-biosamples_post: Refreshing state... [id=agi-vio6m3krml-kt5usv-POST]
module.sbeacon.aws_api_gateway_integration.biosamples-id: Refreshing state... [id=agi-vio6m3krml-pk3lz5-GET]
module.sbeacon.aws_lambda_permission.APIg_variantsIdbiosamples: Refreshing state... [id=AllowAPIg_variantsIdbiosamplesInvoke]
module.sbeacon.aws_lambda_permission.APIbiosamplesFilteringTerms: Refreshing state... [id=AllowAPIbiosamplesFilteringTermsInvoke]
module.sbeacon.aws_lambda_permission.APIg_variants: Refreshing state... [id=AllowAPIg_variantsInvoke]
module.sbeacon.aws_api_gateway_integration.biosamples-id-runs: Refreshing state... [id=agi-vio6m3krml-rlapno-GET]
module.sbeacon.aws_lambda_permission.APIbiosamplesIdruns: Refreshing state... [id=AllowAPIbiosamplesIdrunsInvoke]
module.sbeacon.aws_api_gateway_integration.biosamples_post: Refreshing state... [id=agi-vio6m3krml-elm92x-POST]
module.sbeacon.aws_api_gateway_integration.biosamples-filtering_terms: Refreshing state... [id=agi-vio6m3krml-e4q22t-GET]
module.sbeacon.aws_api_gateway_integration.biosamples-id-analyses_post: Refreshing state... [id=agi-vio6m3krml-gbq211-POST]
module.sbeacon.aws_api_gateway_integration.biosamples: Refreshing state... [id=agi-vio6m3krml-elm92x-GET]
module.sbeacon.aws_api_gateway_integration.biosamples-id_post: Refreshing state... [id=agi-vio6m3krml-pk3lz5-POST]
module.sbeacon.aws_api_gateway_integration.biosamples-id-g_variants: Refreshing state... [id=agi-vio6m3krml-0w8zys-GET]
module.sbeacon.aws_api_gateway_integration.biosamples-filtering_terms_post: Refreshing state... [id=agi-vio6m3krml-e4q22t-POST]
module.sbeacon.aws_api_gateway_integration.biosamples-id-g_variants_post: Refreshing state... [id=agi-vio6m3krml-0w8zys-POST]
module.sbeacon.aws_api_gateway_integration.biosamples-id-analyses: Refreshing state... [id=agi-vio6m3krml-gbq211-GET]
module.sbeacon.aws_lambda_permission.APIbiosamplesIdanalyses: Refreshing state... [id=AllowAPIbiosamplesIdanalysesInvoke]
module.sbeacon.module.lambda-getRuns.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getRuns]
module.sbeacon.aws_lambda_permission.APIbiosamplesId: Refreshing state... [id=AllowAPIbiosamplesIdInvoke]
module.sbeacon.aws_lambda_permission.APIbiosamples: Refreshing state... [id=AllowAPIbiosamplesInvoke]
module.sbeacon.aws_lambda_permission.APIg_variantsIdindividuals: Refreshing state... [id=AllowAPIg_variantsIdindividualsInvoke]
module.sbeacon.module.lambda-getIndividuals.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getIndividuals]
module.sbeacon.aws_lambda_permission.APIbiosamplesIdg_variants: Refreshing state... [id=AllowAPIbiosamplesIdg_variantsInvoke]
module.sbeacon.aws_lambda_permission.APIg_variantsId: Refreshing state... [id=AllowAPIg_variantsIdInvoke]
module.sbeacon.aws_api_gateway_integration.biosamples-id-runs_post: Refreshing state... [id=agi-vio6m3krml-rlapno-POST]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id-biosamples: Refreshing state... [id=agir-vio6m3krml-kt5usv-GET-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants: Refreshing state... [id=agir-vio6m3krml-phabbd-GET-200]
module.sbeacon.aws_lambda_permission.APIanalysesIdg_variants: Refreshing state... [id=AllowAPIanalysesIdg_variantsInvoke]
module.sbeacon.aws_lambda_permission.APIanalyses: Refreshing state... [id=AllowAPIanalysesInvoke]
module.sbeacon.aws_api_gateway_integration.analyses-id-g_variants_post: Refreshing state... [id=agi-vio6m3krml-vp984j-POST]
module.sbeacon.aws_api_gateway_integration.analyses-filtering_terms_post: Refreshing state... [id=agi-vio6m3krml-ce905w-POST]
module.sbeacon.aws_lambda_permission.APIanalysesId: Refreshing state... [id=AllowAPIanalysesIdInvoke]
module.sbeacon.aws_lambda_permission.APIanalysesFilteringTerms: Refreshing state... [id=AllowAPIanalysesFilteringTermsInvoke]
module.sbeacon.aws_api_gateway_integration.analyses-filtering_terms: Refreshing state... [id=agi-vio6m3krml-ce905w-GET]
module.sbeacon.aws_api_gateway_integration.analyses: Refreshing state... [id=agi-vio6m3krml-v24te1-GET]
module.sbeacon.aws_api_gateway_integration.analyses-id-g_variants: Refreshing state... [id=agi-vio6m3krml-vp984j-GET]
module.sbeacon.aws_api_gateway_integration.analyses-id: Refreshing state... [id=agi-vio6m3krml-2zr78d-GET]
module.sbeacon.aws_api_gateway_integration.analyses-id_post: Refreshing state... [id=agi-vio6m3krml-2zr78d-POST]
module.sbeacon.aws_api_gateway_integration.analyses_post: Refreshing state... [id=agi-vio6m3krml-v24te1-POST]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id: Refreshing state... [id=agir-vio6m3krml-evamqh-GET-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id_post: Refreshing state... [id=agir-vio6m3krml-evamqh-POST-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id-individuals_post: Refreshing state... [id=agir-vio6m3krml-kdqaiw-POST-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id-individuals: Refreshing state... [id=agir-vio6m3krml-kdqaiw-GET-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants_post: Refreshing state... [id=agir-vio6m3krml-phabbd-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples_post: Refreshing state... [id=agir-vio6m3krml-elm92x-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-runs: Refreshing state... [id=agir-vio6m3krml-rlapno-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id: Refreshing state... [id=agir-vio6m3krml-pk3lz5-GET-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id-biosamples_post: Refreshing state... [id=agir-vio6m3krml-kt5usv-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-filtering_terms: Refreshing state... [id=agir-vio6m3krml-e4q22t-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples: Refreshing state... [id=agir-vio6m3krml-elm92x-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-analyses_post: Refreshing state... [id=agir-vio6m3krml-gbq211-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id_post: Refreshing state... [id=agir-vio6m3krml-pk3lz5-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-filtering_terms_post: Refreshing state... [id=agir-vio6m3krml-e4q22t-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-g_variants: Refreshing state... [id=agir-vio6m3krml-0w8zys-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-g_variants_post: Refreshing state... [id=agir-vio6m3krml-0w8zys-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-analyses: Refreshing state... [id=agir-vio6m3krml-gbq211-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-runs_post: Refreshing state... [id=agir-vio6m3krml-rlapno-POST-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-id_post: Refreshing state... [id=agir-vio6m3krml-2zr78d-POST-200]
module.sbeacon.aws_api_gateway_integration_response.analyses_post: Refreshing state... [id=agir-vio6m3krml-v24te1-POST-200]
module.sbeacon.aws_lambda_permission.APIdatasetsIdg_variants: Refreshing state... [id=AllowAPIdatasetsIdg_variantsInvoke]
module.sbeacon.aws_api_gateway_integration_response.analyses-filtering_terms_post: Refreshing state... [id=agir-vio6m3krml-ce905w-POST-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-id-g_variants_post: Refreshing state... [id=agir-vio6m3krml-vp984j-POST-200]
module.sbeacon.aws_lambda_permission.APIdatasetsIdfiltering_terms: Refreshing state... [id=AllowAPIdatasetsIdfiltering_termsInvoke]
module.sbeacon.aws_lambda_permission.APIdatasets: Refreshing state... [id=AllowAPIdatasetsInvoke]
module.sbeacon.aws_lambda_permission.APIdatasetsFilteringTerms: Refreshing state... [id=AllowAPIdatasetsFilteringTermsInvoke]
module.sbeacon.aws_lambda_permission.APIdatasetsIdindividuals: Refreshing state... [id=AllowAPIdatasetsIdindividualsInvoke]
module.sbeacon.aws_lambda_permission.APIdatasetsId: Refreshing state... [id=AllowAPIdatasetsIdInvoke]
module.sbeacon.aws_lambda_permission.APIdatasetsIdbiosamples: Refreshing state... [id=AllowAPIdatasetsIdbiosamplesInvoke]
module.sbeacon.aws_api_gateway_integration_response.analyses: Refreshing state... [id=agir-vio6m3krml-v24te1-GET-200]
module.sbeacon.aws_api_gateway_integration.datasets-id-g_variants: Refreshing state... [id=agi-vio6m3krml-3dfpxp-GET]
module.sbeacon.aws_api_gateway_integration.datasets-id: Refreshing state... [id=agi-vio6m3krml-x9pehg-GET]
module.sbeacon.aws_api_gateway_integration_response.analyses-filtering_terms: Refreshing state... [id=agir-vio6m3krml-ce905w-GET-200]
module.sbeacon.aws_api_gateway_integration.datasets-id-g_variants_post: Refreshing state... [id=agi-vio6m3krml-3dfpxp-POST]
module.sbeacon.aws_api_gateway_integration.datasets_post: Refreshing state... [id=agi-vio6m3krml-bbnt2f-POST]
module.sbeacon.aws_api_gateway_integration.datasets: Refreshing state... [id=agi-vio6m3krml-bbnt2f-GET]
module.sbeacon.aws_api_gateway_integration.datasets-id-biosamples: Refreshing state... [id=agi-vio6m3krml-p9oq6b-GET]
module.sbeacon.aws_api_gateway_integration.datasets-id-biosamples_post: Refreshing state... [id=agi-vio6m3krml-p9oq6b-POST]
module.sbeacon.aws_api_gateway_integration_response.analyses-id-g_variants: Refreshing state... [id=agir-vio6m3krml-vp984j-GET-200]
module.sbeacon.aws_api_gateway_integration.datasets-id-individuals: Refreshing state... [id=agi-vio6m3krml-a198cn-GET]
module.sbeacon.aws_api_gateway_integration.datasets-id-individuals_post: Refreshing state... [id=agi-vio6m3krml-a198cn-POST]
module.sbeacon.aws_api_gateway_integration.datasets-id-filtering_terms_post: Refreshing state... [id=agi-vio6m3krml-fpxc3o-POST]
module.sbeacon.aws_api_gateway_integration_response.analyses-id: Refreshing state... [id=agir-vio6m3krml-2zr78d-GET-200]
module.sbeacon.aws_api_gateway_integration.datasets-filtering_terms: Refreshing state... [id=agi-vio6m3krml-q7cb96-GET]
module.sbeacon.aws_api_gateway_integration.datasets-id-filtering_terms: Refreshing state... [id=agi-vio6m3krml-fpxc3o-GET]
module.sbeacon.aws_api_gateway_integration.datasets-id_post: Refreshing state... [id=agi-vio6m3krml-x9pehg-POST]
module.sbeacon.aws_lambda_permission.APIrunsId: Refreshing state... [id=AllowAPIrunsIdInvoke]
module.sbeacon.aws_api_gateway_integration.runs-id-analyses_post: Refreshing state... [id=agi-vio6m3krml-n4hcl2-POST]
module.sbeacon.aws_api_gateway_integration.individuals_post: Refreshing state... [id=agi-vio6m3krml-d3rnwr-POST]
module.sbeacon.aws_api_gateway_integration.datasets-filtering_terms_post: Refreshing state... [id=agi-vio6m3krml-q7cb96-POST]
module.sbeacon.aws_api_gateway_integration.individuals-id-biosamples: Refreshing state... [id=agi-vio6m3krml-e3zeua-GET]
module.sbeacon.aws_api_gateway_integration.runs-filtering_terms_post: Refreshing state... [id=agi-vio6m3krml-74maf3-POST]
module.sbeacon.aws_api_gateway_integration.individuals-filtering_terms_post: Refreshing state... [id=agi-vio6m3krml-y7ipxm-POST]
module.sbeacon.aws_api_gateway_integration.runs-id-g_variants_post: Refreshing state... [id=agi-vio6m3krml-ek90ea-POST]
module.sbeacon.aws_api_gateway_integration.runs-id-analyses: Refreshing state... [id=agi-vio6m3krml-n4hcl2-GET]
module.sbeacon.aws_api_gateway_integration.runs-id: Refreshing state... [id=agi-vio6m3krml-ct24kn-GET]
module.sbeacon.aws_api_gateway_integration.runs-id-g_variants: Refreshing state... [id=agi-vio6m3krml-ek90ea-GET]
module.sbeacon.aws_api_gateway_integration.individuals: Refreshing state... [id=agi-vio6m3krml-d3rnwr-GET]
module.sbeacon.aws_api_gateway_integration.individuals-id: Refreshing state... [id=agi-vio6m3krml-uh0atu-GET]
module.sbeacon.aws_api_gateway_integration.individuals-id-g_variants: Refreshing state... [id=agi-vio6m3krml-pefes2-GET]
module.sbeacon.aws_api_gateway_integration.individuals-id-g_variants_post: Refreshing state... [id=agi-vio6m3krml-pefes2-POST]
module.sbeacon.aws_api_gateway_integration.individuals-filtering_terms: Refreshing state... [id=agi-vio6m3krml-y7ipxm-GET]
module.sbeacon.aws_api_gateway_integration.runs_post: Refreshing state... [id=agi-vio6m3krml-yc1jx7-POST]
module.sbeacon.aws_api_gateway_integration.individuals-id-biosamples_post: Refreshing state... [id=agi-vio6m3krml-e3zeua-POST]
module.sbeacon.aws_api_gateway_integration.runs-id_post: Refreshing state... [id=agi-vio6m3krml-ct24kn-POST]
module.sbeacon.aws_api_gateway_integration.runs-filtering_terms: Refreshing state... [id=agi-vio6m3krml-74maf3-GET]
module.sbeacon.aws_api_gateway_integration.runs: Refreshing state... [id=agi-vio6m3krml-yc1jx7-GET]
module.sbeacon.aws_lambda_permission.APIrunsFilteringTerms: Refreshing state... [id=AllowAPIrunsFilteringTermsInvoke]
module.sbeacon.aws_lambda_permission.APIrunsIdanalyses: Refreshing state... [id=AllowAPIrunsIdanalysesInvoke]
module.sbeacon.aws_lambda_permission.APIindividualsIdg_variants: Refreshing state... [id=AllowAPIindividualsIdg_variantsInvoke]
module.sbeacon.aws_lambda_permission.APIruns: Refreshing state... [id=AllowAPIrunsInvoke]
module.sbeacon.aws_lambda_permission.APIrunsIdg_variants: Refreshing state... [id=AllowAPIrunsIdg_variantsInvoke]
module.sbeacon.aws_lambda_permission.APIindividualsFilteringTerms: Refreshing state... [id=AllowAPIindividualsFilteringTermsInvoke]
module.sbeacon.aws_lambda_permission.APIindividuals: Refreshing state... [id=AllowAPIindividualsInvoke]
module.sbeacon.aws_api_gateway_integration.individuals-id_post: Refreshing state... [id=agi-vio6m3krml-uh0atu-POST]
module.sbeacon.aws_lambda_permission.APIindividualsIdbiosamples: Refreshing state... [id=AllowAPIindividualsIdbiosamplesInvoke]
module.sbeacon.aws_lambda_permission.APIindividualsId: Refreshing state... [id=AllowAPIindividualsIdInvoke]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-g_variants: Refreshing state... [id=agir-vio6m3krml-3dfpxp-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id: Refreshing state... [id=agir-vio6m3krml-x9pehg-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-g_variants_post: Refreshing state... [id=agir-vio6m3krml-3dfpxp-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets: Refreshing state... [id=agir-vio6m3krml-bbnt2f-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets_post: Refreshing state... [id=agir-vio6m3krml-bbnt2f-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-individuals: Refreshing state... [id=agir-vio6m3krml-a198cn-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-biosamples_post: Refreshing state... [id=agir-vio6m3krml-p9oq6b-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-biosamples: Refreshing state... [id=agir-vio6m3krml-p9oq6b-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-filtering_terms_post: Refreshing state... [id=agir-vio6m3krml-fpxc3o-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-filtering_terms: Refreshing state... [id=agir-vio6m3krml-q7cb96-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-individuals_post: Refreshing state... [id=agir-vio6m3krml-a198cn-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-filtering_terms: Refreshing state... [id=agir-vio6m3krml-fpxc3o-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-filtering_terms_post: Refreshing state... [id=agir-vio6m3krml-q7cb96-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id-analyses_post: Refreshing state... [id=agir-vio6m3krml-n4hcl2-POST-200]
module.sbeacon.aws_api_gateway_integration_response.individuals_post: Refreshing state... [id=agir-vio6m3krml-d3rnwr-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs-filtering_terms_post: Refreshing state... [id=agir-vio6m3krml-74maf3-POST-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-filtering_terms_post: Refreshing state... [id=agir-vio6m3krml-y7ipxm-POST-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id-biosamples: Refreshing state... [id=agir-vio6m3krml-e3zeua-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id-g_variants_post: Refreshing state... [id=agir-vio6m3krml-ek90ea-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id-analyses: Refreshing state... [id=agir-vio6m3krml-n4hcl2-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id-g_variants: Refreshing state... [id=agir-vio6m3krml-ek90ea-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id: Refreshing state... [id=agir-vio6m3krml-ct24kn-GET-200]
module.sbeacon.aws_api_gateway_integration_response.individuals: Refreshing state... [id=agir-vio6m3krml-d3rnwr-GET-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id-g_variants: Refreshing state... [id=agir-vio6m3krml-pefes2-GET-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id-g_variants_post: Refreshing state... [id=agir-vio6m3krml-pefes2-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs_post: Refreshing state... [id=agir-vio6m3krml-yc1jx7-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id_post: Refreshing state... [id=agir-vio6m3krml-ct24kn-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs: Refreshing state... [id=agir-vio6m3krml-yc1jx7-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs-filtering_terms: Refreshing state... [id=agir-vio6m3krml-74maf3-GET-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id_post: Refreshing state... [id=agir-vio6m3krml-uh0atu-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id_post: Refreshing state... [id=agir-vio6m3krml-x9pehg-POST-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id: Refreshing state... [id=agir-vio6m3krml-uh0atu-GET-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-filtering_terms: Refreshing state... [id=agir-vio6m3krml-y7ipxm-GET-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id-biosamples_post: Refreshing state... [id=agir-vio6m3krml-e3zeua-POST-200]
module.sbeacon.aws_api_gateway_deployment.BeaconApi: Refreshing state... [id=xtcf9c]
module.sbeacon.aws_api_gateway_stage.BeaconApi: Refreshing state... [id=ags-vio6m3krml-prod]
module.webgui.data.external.build: Reading...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy

Terraform planned the following actions, but then encountered a problem:

  # module.sbeacon.aws_lambda_layer_version.binaries_layer must be replaced
+/- resource "aws_lambda_layer_version" "binaries_layer" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_binaries_layer:8" -> (known after apply)
      ~ code_sha256                 = "SC18ANJ/w5TA+3NTbVe8FYCyjzLxSqbwZlvmyHzYosU=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2024-12-06T01:03:44.753+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_binaries_layer:8" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_binaries_layer" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "SC18ANJ/w5TA+3NTbVe8FYCyjzLxSqbwZlvmyHzYosU=" -> "7M9TOckrMvrfWv9LU4Ea+YyLISaWPudOTePj9JeEu7E=" # forces replacement
      ~ source_code_size            = 12549632 -> (known after apply)
      ~ version                     = "8" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-admin.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-admin"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:8",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:14",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-admin.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1227688897" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1733208216654604000" -> "1733648864843501000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-data-portal.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-dataPortal"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:8",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:14",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-data-portal.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "305728290" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1733283179883287000" -> "1733648865037734000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getAnalyses.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getAnalyses"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:8",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:14",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1847213365" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1733208215682046800" -> "1733648873016145000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getBiosamples.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getBiosamples"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:8",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:14",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1858295625" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1733208216690379000" -> "1733648870626630000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getConfiguration.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getConfiguration"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:8",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:14",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1119957408" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1733208216634527000" -> "1733648874837012000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getDatasets.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getDatasets"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:8",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:14",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getDatasets.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "769785707" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1733208216700196000" -> "1733648871419428200"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getEntryTypes.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getEntryTypes"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:8",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:14",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "345897038" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1733208216193988000" -> "1733648871149703000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getFilteringTerms.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getFilteringTerms"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:8",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:14",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2073847567" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1733208216136665200" -> "1733648864741229000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getGenomicVariants.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getGenomicVariants"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:8",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:14",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "50935569" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1733208217192765000" -> "1733648869732852000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getIndividuals.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getIndividuals"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:8",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:14",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "12673104" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1733208216244577000" -> "1733648870724926000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getInfo.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getInfo"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:8",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:14",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getInfo.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "711118710" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1733208216384512000" -> "1733648874227132000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getMap.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getMap"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:8",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:14",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getMap.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1745917614" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1733208215871723800" -> "1733648873321219000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getProjects.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getProjects"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:8",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:14",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getProjects.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1504117130" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1733490785299055000" -> "1733648874132670000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getRuns.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getRuns"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:8",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:14",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getRuns.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1793291541" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1733208216419596000" -> "1733648866848669000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-indexer.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-indexer"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:8",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:14",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-indexer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1625542289" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1733211137322534000" -> "1733648864826055000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-logEmailDelivery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "370546528" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1733208216134814000" -> "1733648864650534000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-performQuery.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-performQuery"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_binaries_layer:8",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:8",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:14",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-performQuery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1303031516" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1733208215683118200" -> "1733648876414234000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-splitQuery.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-splitQuery"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:8",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:14",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-splitQuery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1401269218" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1733208216011071000" -> "1733648874117603000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-submitDataset.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-submitDataset"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:8",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_binaries_layer:8",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:14",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-submitDataset.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2032750855" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1733283180799968000" -> "1733648875220082000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-updateFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-updateFiles"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_binaries_layer:8",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:8",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:14",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-updateFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1224946619" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1733208215639858000" -> "1733648875232776000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.python_libraries_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:8" -> (known after apply)
      ~ code_sha256                 = "ARRTg1LwxhVOOVAtxd45UZnRhuH5qB8nZPsTg3usi8k=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2024-12-06T01:03:46.798+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:8" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer" -> (known after apply)
      ~ s3_key                      = "builds/14fff1d1178b3e70a290e5e28a8fd8cb14e925458740559f52c5740700adc8d7.zip" -> "builds/01c3b19e3cc0b4011350293d7d3805d9ef8c3c7f5b4f58165a4e4f015a2c34ed.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 22994383 -> (known after apply)
      ~ version                     = "8" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::gasi-lambda-layers-20241204100804138800000002/builds/14fff1d1178b3e70a290e5e28a8fd8cb14e925458740559f52c5740700adc8d7.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "binary/octet-stream" -> (known after apply)
      ~ etag                          = "f7ae3a7190b87115fccd30c223880693-5" -> (known after apply)
      ~ id                            = "builds/14fff1d1178b3e70a290e5e28a8fd8cb14e925458740559f52c5740700adc8d7.zip" -> (known after apply)
      ~ key                           = "builds/14fff1d1178b3e70a290e5e28a8fd8cb14e925458740559f52c5740700adc8d7.zip" -> "builds/01c3b19e3cc0b4011350293d7d3805d9ef8c3c7f5b4f58165a4e4f015a2c34ed.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/14fff1d1178b3e70a290e5e28a8fd8cb14e925458740559f52c5740700adc8d7.zip" -> "builds/01c3b19e3cc0b4011350293d7d3805d9ef8c3c7f5b4f58165a4e4f015a2c34ed.zip"
      - tags                          = {} -> null
      ~ tags_all                      = {} -> (known after apply)
      + version_id                    = (known after apply)
        # (12 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/layers/python_libraries/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/01c3b19e3cc0b4011350293d7d3805d9ef8c3c7f5b4f58165a4e4f015a2c34ed.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/01c3b19e3cc0b4011350293d7d3805d9ef8c3c7f5b4f58165a4e4f015a2c34ed.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.python_libraries_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "644729778" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/14fff1d1178b3e70a290e5e28a8fd8cb14e925458740559f52c5740700adc8d7.zip" -> "builds/01c3b19e3cc0b4011350293d7d3805d9ef8c3c7f5b4f58165a4e4f015a2c34ed.zip"
          ~ "timestamp" = "1733446544741369000" -> "1733648874827386000"
        }
    }

  # module.sbeacon.module.python_modules_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "920602635" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1733283180320480200" -> "1733648877252188000"
            # (1 unchanged element hidden)
        }
    }

Plan: 26 to add, 19 to change, 25 to destroy.
╷
│ Warning: Argument is deprecated
│ 
│   with module.svep.aws_api_gateway_deployment.VPApi,
│   on svep/api.tf line 281, in resource "aws_api_gateway_deployment" "VPApi":
│  281:   stage_name  = "prod"
│ 
│ The attribute "stage_name" will be removed in a future major version. Use
│ an explicit "aws_api_gateway_stage" instead.
│ 
│ (and 2 more similar warnings elsewhere)
╵
╷
│ Error: Error pinging Docker server: Cannot connect to the Docker daemon at unix:///var/run/docker.sock. Is the docker daemon running?
│ 
│   with module.svep.provider["registry.terraform.io/kreuzwerker/docker"],
│   on svep/docker_images.tf line 3, in provider "docker":
│    3: provider "docker" {
│ 
╵
╷
│ Error: External Program Execution Failed
│ 
│   with module.webgui.data.external.build,
│   on webgui/terraform-aws/upload.tf line 2, in data "external" "build":
│    2:   program = ["python", "build_and_hash.py"]
│ 
│ The data source received an unexpected error while attempting to execute
│ the program.
│ 
│ Program: /usr/bin/python
│ Error Message: Traceback (most recent call last):
│   File "/atlantis-data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/50/default/webgui/terraform-aws/build_and_hash.py", line 147, in <module>
│     npm_install(install_cmd, webapp_dir)
│   File "/atlantis-data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/50/default/webgui/terraform-aws/build_and_hash.py", line 58, in npm_install
│     out = subprocess.Popen(
│           ^^^^^^^^^^^^^^^^^
│   File "/usr/local/lib/python3.12/subprocess.py", line 1026, in __init__
│     self._execute_child(args, executable, preexec_fn, close_fds,
│   File "/usr/local/lib/python3.12/subprocess.py", line 1950, in _execute_child
│     raise child_exception_type(errno_num, err_msg, err_filename)
│ FileNotFoundError: [Errno 2] No such file or directory: 'pnpm'
│ 
│ State: exit status 1
╵


```
</details>